name: "stn"
force_backward: true

layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: { dim: 1 dim: 1 dim: 28 dim: 28 }
  }
}


layer {
  name: 'maxpolarpooling'
  type: 'Python'
  bottom: 'data'
  top: 'features'
  top: 'activations'
  python_param {
    module: 'layer'
    layer: 'MaxPolarPoolingLayer'
    param_str: "'kernal_size_rho': 14\n'stride_rho': 14\n'kernal_size_phi': 10\n'stride_phi': 5\n'debug': False\n'vis': True"
  }
}