Network Info Summary
=======================================================================================================
Layer (type)                  Output Shape             Param          Memory Usage(data, param)
-------------------------------------------------------------------------------------------------------
data (Input)                  (16, 384, 256, 3)        0              18.0 MiB (18.0 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv1 (Convolution)           (16, 384, 256, 128)      3584           768.0 MiB (768.0 MiB, 14.0 KiB)
-------------------------------------------------------------------------------------------------------
pool1 (Pooling)               (16, 192, 128, 128)      0              192.0 MiB (192.0 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
Total params: 3,584
Total memory usage: 978.0 MiB (data: 978.0 MiB, param: 14.0 KiB)
=======================================================================================================
